stm32-rs/stm32f3xx-hal/src/pwm.rs
#[cfg(feature = "stm32f373")]
macro_rules! tim12 {
    () => {
        use crate::pac::TIM12;

        /// Output Compare Channel 1 of Timer 12 (type state)
        pub struct TIM12_CH1 {}
        /// Output Compare Channel 2 of Timer 12 (type state)
        pub struct TIM12_CH2 {}
        /// Output Compare Channel 3 of Timer 12 (type state)
        pub struct TIM12_CH3 {}
        /// Output Compare Channel 4 of Timer 12 (type state)
        pub struct TIM12_CH4 {}

        pwm_timer_basic!(
            tim12,
            TIM12,
            u16,
            apb1enr,
            apb1rstr,
            pclk1,
            tim12rst,
            tim12en,
            [TIM12_CH1, TIM12_CH2],
            [PwmChannel, PwmChannel]
        );

        // Channels
        pwm_pin_for_pwm_channel!(TIM12, TIM12_CH1, u16, cc1e, ccr1, ccr);
        pwm_pin_for_pwm_channel!(TIM12, TIM12_CH2, u16, cc2e, ccr2, ccr);

        // Pins
        pwm_channel1_pin!(TIM12, TIM12_CH1, output_to_pa4, gpioa::PA4<gpio::AF10>);
        pwm_channel1_pin!(TIM12, TIM12_CH1, output_to_pa14, gpioa::PA14<gpio::AF10>);
        pwm_channel1_pin!(TIM12, TIM12_CH1, output_to_pb14, gpiob::PB14<gpio::AF10>);

        pwm_channel2_pin!(TIM12, TIM12_CH2, output_to_pa5, gpioa::PA5<gpio::AF10>);
        pwm_channel2_pin!(TIM12, TIM12_CH2, output_to_pa15, gpioa::PA15<gpio::AF10>);
        pwm_channel2_pin!(TIM12, TIM12_CH2, output_to_pb15, gpiob::PB15<gpio::AF10>);
    };
}

// TODO: This timer is also present in stm32f378
#[cfg(feature = "stm32f373")]
tim12!();

// TIM13

#[cfg(feature = "stm32f373")]
macro_rules! tim13 {
    () => {
        use crate::pac::TIM13;

        /// Output Compare Channel 1 of Timer 13 (type state)
        pub struct TIM13_CH1 {}
        /// Output Compare Channel 2 of Timer 13 (type state)
        pub struct TIM13_CH2 {}
        /// Output Compare Channel 3 of Timer 13 (type state)
        pub struct TIM13_CH3 {}
        /// Output Compare Channel 4 of Timer 13 (type state)
        pub struct TIM13_CH4 {}

        pwm_timer_basic!(
            tim13,
            TIM13,
            u16,
            apb1enr,
            apb1rstr,
            pclk1,
            tim13rst,
            tim13en,
            [TIM13_CH1],
            [PwmChannel]
        );

        // Channels
        pwm_pin_for_pwm_channel!(TIM13, TIM13_CH1, u16, cc1e, ccr1, ccr);

        // Pins
        pwm_channel1_pin!(TIM13, TIM13_CH1, output_to_pa6, gpioa::PA6<gpio::AF9>);
        pwm_channel1_pin!(TIM13, TIM13_CH1, output_to_pa9, gpioa::PA9<gpio::AF2>);
        pwm_channel1_pin!(TIM13, TIM13_CH1, output_to_pb3, gpiob::PB3<gpio::AF9>);
        pwm_channel1_pin!(TIM13, TIM13_CH1, output_to_pc4, gpioc::PC4<gpio::AF2>);
    };
}

#[cfg(feature = "stm32f373")]
tim13!();

// TIM14

#[cfg(feature = "stm32f373")]
macro_rules! tim14 {
    () => {
        use crate::pac::TIM14;

        /// Output Compare Channel 1 of Timer 14 (type state)
        pub struct TIM14_CH1 {}
        /// Output Compare Channel 2 of Timer 14 (type state)
        pub struct TIM14_CH2 {}
        /// Output Compare Channel 3 of Timer 14 (type state)
        pub struct TIM14_CH3 {}
        /// Output Compare Channel 4 of Timer 14 (type state)
        pub struct TIM14_CH4 {}

        pwm_timer_basic!(
            tim14,
            TIM14,
            u16,
            apb1enr,
            apb1rstr,
            pclk1,
            tim14rst,
            tim14en,
            [TIM14_CH1],
            [PwmChannel]
        );

        // Channels
        pwm_pin_for_pwm_channel!(TIM14, TIM14_CH1, u16, cc1e, ccr1, ccr);

        // Pins
        pwm_channel1_pin!(TIM14, TIM14_CH1, output_to_pa5, gpioa::PA5<gpio::AF9>);
        pwm_channel1_pin!(TIM14, TIM14_CH1, output_to_pa7, gpioa::PA7<gpio::AF9>);
        pwm_channel1_pin!(TIM14, TIM14_CH1, output_to_pa10, gpioa::PA10<gpio::AF9>);
        pwm_channel1_pin!(TIM14, TIM14_CH1, output_to_pf9, gpiof::PF9<gpio::AF2>);
    };
}

// TODO: This timer is also present in stm32f378
#[cfg(feature = "stm32f373")]
tim14!();

// TIM15

pwm_timer_with_break!(
    tim15,
    TIM15,
    u16,
    apb2enr,
    apb2rstr,
    pclk2,
    tim15rst,
    tim15en,
    [TIM15_CH1, TIM15_CH2],
    [PwmChannel, PwmChannel]
);

// Channels
pwm_pin_for_pwm_n_channel!(TIM15, TIM15_CH1, u16, cc1e, cc1ne, ccr1, ccr1);
pwm_pin_for_pwm_channel!(TIM15, TIM15_CH2, u16, cc2e, ccr2, ccr2);

// Pins
pwm_channel1_pin!(TIM15, TIM15_CH1, output_to_pa2, gpioa::PA2<gpio::AF9>);
#[cfg(any(feature = "stm32f373", feature = "stm32f378"))]
pwm_channel1_pin!(TIM15, TIM15_CH1, output_to_pb6, gpiob::PB6<gpio::AF9>);
pwm_channel1_pin!(TIM15, TIM15_CH1, output_to_pb14, gpiob::PB14<gpio::AF1>);
#[cfg(any(
    feature = "stm32f302xb",
    feature = "stm32f302xc",
    feature = "stm32f302xd",
    feature = "stm32f302xe",
    feature = "stm32f303xb",
    feature = "stm32f303xc",
    feature = "stm32f303xd",
    feature = "stm32f303xe",
    feature = "stm32f358",
    feature = "stm32f398"
))]
pwm_channel1_pin!(TIM15, TIM15_CH1, output_to_pf9, gpiof::PF9<gpio::AF3>);

pwm_channel1n_pin!(TIM15, TIM15_CH1, output_to_pa1, gpioa::PA1<gpio::AF9>);
pwm_channel1n_pin!(TIM15, TIM15_CH1, output_to_pb15, gpiob::PB15<gpio::AF2>);
pwm_channel2_pin!(TIM15, TIM15_CH2, output_to_pa3, gpioa::PA3<gpio::AF9>);
#[cfg(any(feature = "stm32f373", feature = "stm32f378"))]
pwm_channel2_pin!(TIM15, TIM15_CH2, output_to_pb7, gpiob::PB7<gpio::AF9>);
pwm_channel2_pin!(TIM15, TIM15_CH2, output_to_pb15, gpiob::PB15<gpio::AF2>);
#[cfg(any(
    feature = "stm32f302xb",
    feature = "stm32f302xc",
    feature = "stm32f302xd",
    feature = "stm32f302xe",
    feature = "stm32f303xb",
    feature = "stm32f303xc",
    feature = "stm32f303xd",
    feature = "stm32f303xe",
    feature = "stm32f358",
    feature = "stm32f398"
))]
pwm_channel2_pin!(TIM15, TIM15_CH2, output_to_pf10, gpiof::PF10<gpio::AF3>);

// TIM16

pwm_timer_with_break!(
    tim16,
    TIM16,
    u16,
    apb2enr,
    apb2rstr,
    pclk2,
    tim16rst,
    tim16en,
    [TIM16_CH1],
    [PwmChannel]
);

// Channels
pwm_pin_for_pwm_n_channel!(TIM16, TIM16_CH1, u16, cc1e, cc1ne, ccr1, ccr1);

// Pins
pwm_channel1_pin!(TIM16, TIM16_CH1, output_to_pa9, gpioa::PA6<gpio::AF1>);
pwm_channel1_pin!(TIM16, TIM16_CH1, output_to_pa12, gpioa::PA12<gpio::AF1>);
pwm_channel1_pin!(TIM16, TIM16_CH1, output_to_pb4, gpiob::PB4<gpio::AF1>);
pwm_channel1_pin!(TIM16, TIM16_CH1, output_to_pb8, gpiob::PB8<gpio::AF1>);
#[cfg(any(
    feature = "stm32f302xb",
    feature = "stm32f302xc",
    feature = "stm32f302xd",
    feature = "stm32f302xe",
    feature = "stm32f303xb",
    feature = "stm32f303xc",
    feature = "stm32f303xd",
    feature = "stm32f303xe",
    feature = "stm32f358",
    feature = "stm32f398"
))]
pwm_channel1_pin!(TIM16, TIM16_CH1, output_to_pe0, gpioe::PE0<gpio::AF4>);

pwm_channel1n_pin!(TIM16, TIM16_CH1, output_to_pa13, gpioa::PA13<gpio::AF1>);
pwm_channel1n_pin!(TIM16, TIM16_CH1, output_to_pb6, gpiob::PB6<gpio::AF1>);

// TIM17

