stm32-rs/stm32f3xx-hal/src/pwm.rs
pwm_timer_with_break!(
    tim17,
    TIM17,
    u16,
    apb2enr,
    apb2rstr,
    pclk2,
    tim17rst,
    tim17en,
    [TIM17_CH1],
    [PwmChannel]
);

// Channels
pwm_pin_for_pwm_n_channel!(TIM17, TIM17_CH1, u16, cc1e, cc1ne, ccr1, ccr1);

// Pins
pwm_channel1_pin!(TIM17, TIM17_CH1, output_to_pa7, gpioa::PA7<gpio::AF1>);
pwm_channel1_pin!(TIM17, TIM17_CH1, output_to_pb5, gpiob::PB5<gpio::AF10>);
pwm_channel1_pin!(TIM17, TIM17_CH1, output_to_pb9, gpiob::PB9<gpio::AF1>);
#[cfg(any(
    feature = "stm32f302xb",
    feature = "stm32f302xc",
    feature = "stm32f302xd",
    feature = "stm32f302xe",
    feature = "stm32f303xb",
    feature = "stm32f303xc",
    feature = "stm32f303xd",
    feature = "stm32f303xe",
    feature = "stm32f358",
    feature = "stm32f398"
))]
pwm_channel1_pin!(TIM17, TIM17_CH1, output_to_pe1, gpioe::PE1<gpio::AF4>);

pwm_channel1n_pin!(TIM17, TIM17_CH1, output_to_pa13, gpioa::PA13<gpio::AF1>);

// TIM19

#[cfg(feature = "stm32f373")]
macro_rules! tim19 {
    () => {
        use crate::pac::TIM19;

        /// Output Compare Channel 1 of Timer 19 (type state)
        pub struct TIM19_CH1 {}
        /// Output Compare Channel 2 of Timer 19 (type state)
        pub struct TIM19_CH2 {}
        /// Output Compare Channel 3 of Timer 19 (type state)
        pub struct TIM19_CH3 {}
        /// Output Compare Channel 4 of Timer 19 (type state)
        pub struct TIM19_CH4 {}

        pwm_timer_basic!(
            tim19,
            TIM19,
            u16,
            apb2enr,
            apb2rstr,
            pclk2,
            tim19rst,
            tim19en,
            [TIM19_CH1, TIM19_CH2, TIM19_CH3, TIM19_CH4],
            [PwmChannel, PwmChannel, PwmChannel, PwmChannel]
        );

        // Channels
        pwm_pin_for_pwm_channel!(TIM19, TIM19_CH1, u16, cc1e, ccr1, ccr);
        pwm_pin_for_pwm_channel!(TIM19, TIM19_CH2, u16, cc2e, ccr2, ccr);
        pwm_pin_for_pwm_channel!(TIM19, TIM19_CH3, u16, cc3e, ccr3, ccr);
        pwm_pin_for_pwm_channel!(TIM19, TIM19_CH4, u16, cc4e, ccr4, ccr);

        // Pins
        pwm_channel1_pin!(TIM19, TIM19_CH1, output_to_pa0, gpioa::PA0<gpio::AF11>);
        pwm_channel1_pin!(TIM19, TIM19_CH1, output_to_pb6, gpiob::PB6<gpio::AF11>);
        pwm_channel1_pin!(TIM19, TIM19_CH1, output_to_pc10, gpioc::PC10<gpio::AF2>);

        pwm_channel2_pin!(TIM19, TIM19_CH2, output_to_pa1, gpioa::PA1<gpio::AF11>);
        pwm_channel2_pin!(TIM19, TIM19_CH2, output_to_pb7, gpiob::PB7<gpio::AF11>);
        pwm_channel2_pin!(TIM19, TIM19_CH2, output_to_pc11, gpioc::PC11<gpio::AF2>);

        pwm_channel3_pin!(TIM19, TIM19_CH3, output_to_pa2, gpioa::PA2<gpio::AF11>);
        pwm_channel3_pin!(TIM19, TIM19_CH3, output_to_pb8, gpiob::PB8<gpio::AF11>);
        pwm_channel3_pin!(TIM19, TIM19_CH3, output_to_pc12, gpioc::PC12<gpio::AF2>);

        pwm_channel4_pin!(TIM19, TIM19_CH4, output_to_pa3, gpioa::PA3<gpio::AF11>);
        pwm_channel4_pin!(TIM19, TIM19_CH4, output_to_pb9, gpiob::PB9<gpio::AF11>);
        pwm_channel4_pin!(TIM19, TIM19_CH4, output_to_pd0, gpiod::PD0<gpio::AF2>);
    };
}

// TODO: This timer is also present in stm32f378
#[cfg(feature = "stm32f373")]
tim19!();

// TIM20
//
#[cfg(feature = "stm32f398")]
macro_rules! tim20 {
    () => {
        use crate::pac::TIM20;

        /// Output Compare Channel 1 of Timer 20 (type state)
        pub struct TIM20_CH1 {}
        /// Output Compare Channel 2 of Timer 20 (type state)
        pub struct TIM20_CH2 {}
        /// Output Compare Channel 3 of Timer 20 (type state)
        pub struct TIM20_CH3 {}
        /// Output Compare Channel 4 of Timer 20 (type state)
        pub struct TIM20_CH4 {}

        pwm_timer_basic!(
            tim20,
            TIM20,
            u16,
            apb2enr,
            apb2rstr,
            pclk2,
            tim20rst,
            tim20en,
            [TIM20_CH1, TIM20_CH2, TIM20_CH3, TIM20_CH4],
            [PwmChannel, PwmChannel, PwmChannel, PwmChannel]
        );

        // Channels
        // TODO: stm32f3 doesn't suppport registers for all 4 channels
        pwm_pin_for_pwm_n_channel!(TIM20, TIM20_CH1, u16, cc1e, cc1ne, ccr1, ccr1);

        //Pins
        pwm_channel1_pin!(TIM20, TIM20_CH1, output_to_pe2, gpioe::PE2<gpio::AF6>);

        pwm_channel1n_pin!(TIM20, TIM20_CH1, output_to_pe4, gpioe::PE4<gpio::AF6>);
    };
}

#[cfg(feature = "stm32f398")]
tim20!();
